package com.kh.IfEx;
/*
1. if
 : 만약에 ( ) 안에 작성한 조건이 참일때만 특정 코드블록을 실행하는 제어문
 
	 if(조건){
	 	조건이 참일 때 실행하는 코드
	 }
	 
 if는 생략이 불가능하지만 else와 else if는 작성하지 않아도 문제없음
 
 2. if else if else
	  if(조건1){
	  	조건1이 참일때 실행되는 코드
	  }else if (조건2){
	  	조건1이 거짓이고, 조건2가 참일때 실행되는 콛,
	  }else{
	  	위 모든 조건이 거짓일때 실행되는 코드
	  }
	 
 3. if - else
 	if의 조건이 거짓일 때 실행하고자하는 내용이 있다면 else를 사용해서 {} 안에 거짓에 대한 내용을 적음
 	if(조건){
 		조건이 참일때 실행되는 코드들
 	}else{
 		조건이 거짓일때 실행되는 코드들
 	}
 	
 	
  4. 간단하게 사용하는 if else문 (=삼항연산자)
  	(조건 ? 조건이 true일때 진행할 내용 : 조건이 false일때 진행할 내용)
  
  
  if문에서 블록 안에는 system.out.print 이외에 내가 작성하고 싶은 코드를 모두 작성할 수 있지만
  현재 출력문을 사용하는 방식이 우리가 익히기 편하기 때문에 system.out.print와 같은 출력문만
  작성하는 것일 뿐이지 무조건 print만 되는 것은 아님
 	
*/


public class IF문 {

}
